/**
 * ==================================================================================
 * 비지니스 로직 접속 정보 : 로컬 PC
 * ==================================================================================
 */

// -- 로컬 접속
var api_url = 'http://127.0.0.1:18070/apis';


// -- 개발기 접속
// var api_url = 'http://10.52.26.63:9101/apis';

// -- 운영기 접속
//var api_url = 'http://10.52.21.118:9121/apis';


// ==================================================================================

// -- 이미지는 기본이 개발기
//var api_img_url = 'http://10.52.26.63:9101/apis';
var api_img_url = api_url;

/**
 * ==================================================================================
 * 기타 기본 셋팅 정보
 * ==================================================================================
 */
var noImgPath = '/resources/img/noPreview.png';
var dummyImgPath = '/resources/img/glass.jpg';
var date_opts = {
	dateFormat : 'yy-mm-dd',
	altFormat : 'yymmdd',
	prevText : '<i class="fa fa-chevron-left"></i>',
	nextText : '<i class="fa fa-chevron-right"></i>'
};